Horion0415/xiaozhi-esp32/components/esp32_c5_sensairpanel/esp32_c5_sensairpanel.c
/*
 * SPDX-FileCopyrightText: 2023-2024 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <math.h>
#include "esp_timer.h"
#include "driver/gpio.h"
#include "driver/ledc.h"
#include "driver/spi_master.h"
#include "driver/i2c_master.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_spiffs.h"
#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_vendor.h"
#include "esp_lcd_panel_ops.h"
#include "driver/rmt_tx.h"
#include "led_strip.h"
#include "led_strip_interface.h"
#include "esp_sleep.h"
#include "touch_ic_bs8112a3.h"
#include "light_sensor_rpr0521.h"
#include "soc/gpio_sig_map.h"

#include "adc_mic.h"
#include <stdlib.h>
#include "hal/gpio_ll.h"
#include "audio_player.h"
#include "file_iterator.h"

#include "ir_remote_control.h"

#include "bsp/esp-bsp.h"
#include "bsp/display.h"
#include "bsp_err_check.h"
#include "esp_lcd_gc9a01.h"
#include "esp_lvgl_port.h"
#include "esp_codec_dev_defaults.h"

static const char *TAG = "ESP32-C5-Sensairpanel";

static size_t read_wav_data_chunk(FILE *fp, long *data_offset, uint32_t *data_size);
static esp_err_t bsp_wav_play_file_internal(const char *file_path);

/**
 * @brief ESP32-C5-Sensairpanel I2S pinout
 *
 * Can be used for i2s_pdm_tx_gpio_config_t and/or i2s_pdm_tx_config_t initialization
 */
#define BSP_I2S_GPIO_CFG(_dout)   \
    {                          \
        .clk = GPIO_NUM_NC,    \
        .dout = _dout,         \
        .invert_flags = {      \
            .clk_inv = false,  \
        },                     \
    }

/**
 * @brief Mono Duplex I2S configuration structure
 *
 * This configuration is used by default in bsp_audio_init()
 */
#define BSP_I2S_DUPLEX_MONO_CFG(_sample_rate, _dout)                                            \
    {                                                                                        \
        .clk_cfg = I2S_PDM_TX_CLK_DEFAULT_CONFIG(_sample_rate),                             \
        .slot_cfg = I2S_PDM_TX_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO), \
        .gpio_cfg = BSP_I2S_GPIO_CFG(_dout),                                                \
    }

// Button
static button_handle_t bsp_button_handles[BSP_INPUT_MAX] = {NULL};
static bsp_button_callback_t global_button_callback = NULL;
static bool touch_hardware_available = false;  // Track touch hardware availability

// I2C
static i2c_master_bus_handle_t s_i2c_bus_handle = NULL;

// Light Sensor
static bool light_sensor_available = false;  // Track light sensor availability

// LED
static led_strip_handle_t led_strip = NULL;
static bsp_led_config_t led_configs[BSP_LED_STRIP_COUNT];
static esp_timer_handle_t led_effect_timer = NULL;
static bsp_led_effect_t current_effect = BSP_LED_EFFECT_STATIC;
static bool effect_running = false;
static uint8_t effect_step = 0;

// LED Matrix (16x16 on BSP_RGB_EXT_CTRL)
static led_strip_handle_t s_led_mx = NULL;
static uint32_t s_led_mx_fb[BSP_LED_MATRIX_ROWS * BSP_LED_MATRIX_COLS];
static uint8_t s_led_mx_brightness = 160; // 0-255
static esp_timer_handle_t s_led_mx_timer = NULL;
static bsp_led_matrix_effect_t s_led_mx_effect = BSP_LED_MX_EFFECT_STATIC;
static uint16_t s_led_mx_phase = 0;

// Audio
static const audio_codec_data_if_t *i2s_data_if = NULL;  /* Codec data interface */
static i2s_chan_handle_t i2s_tx_chan;
static esp_codec_dev_handle_t speaker_dev_handle = NULL;
static esp_codec_dev_handle_t microphone_dev_handle = NULL;  /* Add microphone device handle */
static bool audio_player_initialized = false;
static bool speaker_device_opened = false;
static bool microphone_device_opened = false;  /* Add microphone device state */
static uint8_t current_volume = BSP_AUDIO_VOLUME_DEFAULT;
static audio_player_cb_t audio_callback = NULL;
static void *audio_callback_user_data = NULL;
static bool s_wav_playing = false;

// Vibration sensor functions
static int vibration_level_change_count = 0;  
static int last_vibration_level = -1;         
static bool vibration_detected = false;   
static int g_vibration_sensitivity_threshold = 5;    

// LED strip config
static const led_strip_config_t bsp_strip_config = {
    .strip_gpio_num = BSP_RGB_CTRL,
    .max_leds = BSP_LED_STRIP_COUNT,    
    .led_model = LED_MODEL_WS2812,
    .flags.invert_out = false,
};

static const led_strip_rmt_config_t bsp_rmt_config = {
    .clk_src = RMT_CLK_SRC_DEFAULT,
    .resolution_hz = 10 * 1000 * 1000,
    .flags.with_dma = false,
};

typedef struct {
    char file_path[128];
    bool stop_current;
} wav_play_request_t;

static TaskHandle_t s_wav_task_handle = NULL;
static QueueHandle_t s_wav_queue = NULL;
static SemaphoreHandle_t s_wav_mutex = NULL;
static volatile bool s_wav_task_running = false;

static void wav_play_task(void *arg)
{
    wav_play_request_t request;
    s_wav_task_running = true;
    
    while (s_wav_task_running) {
        if (xQueueReceive(s_wav_queue, &request, pdMS_TO_TICKS(50)) == pdTRUE) {
            if (xSemaphoreTake(s_wav_mutex, pdMS_TO_TICKS(5)) == pdTRUE) {
                if (request.stop_current) {
                    s_wav_playing = false;
                    vTaskDelay(pdMS_TO_TICKS(5));
                }
                
                if (request.file_path[0] != '\0' && s_wav_task_running) {
                    bsp_wav_play_file_internal(request.file_path);
                }
                xSemaphoreGive(s_wav_mutex);
            }
        }
    }
    vTaskDelete(NULL);
}

static esp_err_t bsp_wav_play_file_internal(const char *file_path)
{
    if (!file_path) return ESP_ERR_INVALID_ARG;
    if (!speaker_dev_handle) {
        speaker_dev_handle = bsp_audio_codec_speaker_init();
        if (!speaker_dev_handle) return ESP_FAIL;
    }
    esp_codec_dev_sample_info_t fs = {
        .sample_rate = BSP_OUTPUT_SAMPLE_RATE,
        .channel = 1,
        .bits_per_sample = 16,
    };
    {
        esp_err_t orc = esp_codec_dev_open(speaker_dev_handle, &fs);
        if (orc == ESP_OK) {
            speaker_device_opened = true;
            if (BSP_PA_CTL_GPIO != GPIO_NUM_NC) gpio_set_level(BSP_PA_CTL_GPIO, 1);
        }
    }
    FILE *fp = fopen(file_path, "rb");
    if (!fp) return ESP_FAIL;
    uint8_t header[44];
    if (fread(header, 1, sizeof(header), fp) != sizeof(header)) { fclose(fp); return ESP_FAIL; }
    if (memcmp(header, "RIFF", 4) || memcmp(header + 8, "WAVE", 4)) { fclose(fp); return ESP_FAIL; }
    long data_off = 0; uint32_t data_sz = 0;
    if (!read_wav_data_chunk(fp, &data_off, &data_sz)) { fclose(fp); return ESP_FAIL; }
    fseek(fp, data_off, SEEK_SET);
    const size_t buf_sz = 1024;
    uint8_t *buf = (uint8_t *)heap_caps_malloc(buf_sz, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!buf) { fclose(fp); return ESP_ERR_NO_MEM; }
    s_wav_playing = true;
    bool reopen_tried = false;
    uint32_t write_count = 0;
    while (data_sz > 0 && s_wav_playing && s_wav_task_running) {
        size_t to_read = data_sz > buf_sz ? buf_sz : data_sz;
        size_t r = fread(buf, 1, to_read, fp);
        if (r == 0) break;
        
        if (!s_wav_playing || !s_wav_task_running) break;
        
        esp_err_t ret = esp_codec_dev_write(speaker_dev_handle, buf, r);
        if (ret != ESP_OK) {
            if (!reopen_tried) {
                esp_codec_dev_open(speaker_dev_handle, &fs);
                reopen_tried = true;
                continue;
            }
            break;
        }
        data_sz -= r;
        write_count++;
        
        if (write_count % 4 == 0) {
            vTaskDelay(pdMS_TO_TICKS(1));
        }
    }
    s_wav_playing = false;
    heap_caps_free(buf);
    fclose(fp);
    return ESP_OK;
}

/* Power control */
void __attribute__((constructor)) bsp_power_control_init(void)
{
    ESP_LOGW(TAG, "ESP32-C5 Sensairpanel power control auto init");

    gpio_config_t io_power_conf = {
        .pin_bit_mask = (1ULL << BSP_POWER_CTRL),
        .mode = GPIO_MODE_OUTPUT,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .intr_type = GPIO_INTR_DISABLE
    };
    gpio_config(&io_power_conf);

    gpio_set_level(BSP_POWER_CTRL, 1);
}

void bsp_power_control_set_power(bool power_on)
{
    gpio_set_level(BSP_POWER_CTRL, power_on ? 1 : 0);
}




/* LED */
esp_err_t bsp_led_init()
{
    ESP_LOGI(TAG, "Initializing LED strip with %d LEDs on GPIO %d", 
             BSP_LED_STRIP_COUNT, bsp_strip_config.strip_gpio_num);

    esp_err_t ret = led_strip_new_rmt_device(&bsp_strip_config, &bsp_rmt_config, &led_strip);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to create LED strip: %s", esp_err_to_name(ret));
        return ret;
    }

