Horion0415/xiaozhi-esp32/components/esp32_c5_sensairpanel/esp32_c5_sensairpanel.c
    for (int i = 0; i < BSP_LED_STRIP_COUNT; i++) {
        led_configs[i].color = BSP_LED_COLOR_OFF;
        led_configs[i].brightness = BSP_LED_BRIGHTNESS_MID;
        led_configs[i].effect = BSP_LED_EFFECT_STATIC;
        led_configs[i].effect_speed = 1000;
    }

    ret = led_strip_clear(led_strip);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to clear LED strip: %s", esp_err_to_name(ret));
        led_strip_del(led_strip);
        return ret;
    }

    ESP_LOGI(TAG, "LED strip initialized successfully");
    return ESP_OK;
}

esp_err_t bsp_led_deinit()
{
    if (led_effect_timer) {
        esp_timer_stop(led_effect_timer);
        esp_timer_delete(led_effect_timer);
        led_effect_timer = NULL;
    }
    
    if (led_strip) {
        esp_err_t ret = led_strip_del(led_strip);
        led_strip = NULL;
        return ret;
    }
    
    return ESP_OK;
}

esp_err_t bsp_led_set_rgb(uint8_t index, uint8_t r, uint8_t g, uint8_t b)
{
    if (!led_strip) {
        return ESP_ERR_INVALID_STATE;
    }

    esp_err_t ret = ESP_OK;

    if (index == BSP_LED_ALL_INDEX) {
        for (int i = 0; i < BSP_LED_STRIP_COUNT; i++) {
            ret |= led_strip_set_pixel(led_strip, i, r, g, b);
            led_configs[i].color = (r << 16) | (g << 8) | b;
        }
    } else if (index < BSP_LED_STRIP_COUNT) {
        ret = led_strip_set_pixel(led_strip, index, r, g, b);
        led_configs[index].color = (r << 16) | (g << 8) | b;
    } else {
        return ESP_ERR_INVALID_ARG;
    }

    if (ret == ESP_OK) {
        ret = led_strip_refresh(led_strip);
    }

    return ret;
}

esp_err_t bsp_led_set_color(uint8_t index, uint32_t color)
{
    uint8_t r = (color >> 16) & 0xFF;
    uint8_t g = (color >> 8) & 0xFF;
    uint8_t b = color & 0xFF;
    
    return bsp_led_set_rgb(index, r, g, b);
}

esp_err_t bsp_led_set_hsv(uint8_t index, uint16_t hue, uint8_t saturation, uint8_t value)
{
    if (!led_strip) {
        return ESP_ERR_INVALID_STATE;
    }

    esp_err_t ret = ESP_OK;

    if (index == BSP_LED_ALL_INDEX) {
        for (int i = 0; i < BSP_LED_STRIP_COUNT; i++) {
            ret |= led_strip_set_pixel_hsv(led_strip, i, hue, saturation, value);
        }
    } else if (index < BSP_LED_STRIP_COUNT) {
        ret = led_strip_set_pixel_hsv(led_strip, index, hue, saturation, value);
    } else {
        return ESP_ERR_INVALID_ARG;
    }

    if (ret == ESP_OK) {
        ret = led_strip_refresh(led_strip);
    }

    return ret;
}

esp_err_t bsp_led_set_colors(const uint32_t *colors)
{
    if (!led_strip || !colors) {
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t ret = ESP_OK;
    
    for (int i = 0; i < BSP_LED_STRIP_COUNT; i++) {
        uint8_t r = (colors[i] >> 16) & 0xFF;
        uint8_t g = (colors[i] >> 8) & 0xFF;
        uint8_t b = colors[i] & 0xFF;
        
        ret |= led_strip_set_pixel(led_strip, i, r, g, b);
        led_configs[i].color = colors[i];
    }

    if (ret == ESP_OK) {
        ret = led_strip_refresh(led_strip);
    }

    return ret;
}

esp_err_t bsp_led_set_all_rgb(uint8_t r, uint8_t g, uint8_t b)
{
    return bsp_led_set_rgb(BSP_LED_ALL_INDEX, r, g, b);
}

esp_err_t bsp_led_clear(uint8_t index)
{
    return bsp_led_set_rgb(index, 0, 0, 0);
}

esp_err_t bsp_led_clear_all()
{
    if (!led_strip) {
        return ESP_ERR_INVALID_STATE;
    }
    
    return led_strip_clear(led_strip);
}

static void led_effect_timer_callback(void *arg)
{
    if (!effect_running || !led_strip) {
        return;
    }

    switch (current_effect) {
        case BSP_LED_EFFECT_BREATHING: {
            float brightness = (sin(effect_step * 0.1) + 1.0) / 2.0;
            uint8_t level = (uint8_t)(brightness * 255);
            bsp_led_set_all_rgb(level, level, level);
            break;
        }
        
        case BSP_LED_EFFECT_RAINBOW: {
            for (int i = 0; i < BSP_LED_STRIP_COUNT; i++) {
                uint16_t hue = (effect_step * 10 + i * 60) % 360;
                led_strip_set_pixel_hsv(led_strip, i, hue, 255, 128);
            }
            led_strip_refresh(led_strip);
            break;
        }
        
        case BSP_LED_EFFECT_CHASE: {
            bsp_led_clear_all();
            uint8_t pos = effect_step % BSP_LED_STRIP_COUNT;
            bsp_led_set_rgb(pos, 255, 255, 255);
            break;
        }
        
        default:
            break;
    }
    
    effect_step++;
}

esp_err_t bsp_led_start_effect(bsp_led_effect_t effect, uint32_t color, uint16_t speed)
{
    if (effect >= BSP_LED_EFFECT_MAX) {
        return ESP_ERR_INVALID_ARG;
    }

    bsp_led_stop_effect();

    current_effect = effect;
    effect_step = 0;
    effect_running = true;

    esp_timer_create_args_t timer_args = {
        .callback = led_effect_timer_callback,
        .arg = NULL,
        .name = "led_effect_timer"
    };
    
    esp_err_t ret = esp_timer_create(&timer_args, &led_effect_timer);
    if (ret != ESP_OK) {
        return ret;
    }

    return esp_timer_start_periodic(led_effect_timer, speed * 1000);
}

esp_err_t bsp_led_stop_effect()
{
    effect_running = false;
    
    if (led_effect_timer) {
        esp_timer_stop(led_effect_timer);
        esp_timer_delete(led_effect_timer);
        led_effect_timer = NULL;
    }
    
    return ESP_OK;
}

esp_err_t bsp_led_rgb_set(uint8_t r, uint8_t g, uint8_t b)
{
    return bsp_led_set_all_rgb(r, g, b);
}

/* Touch-LED Synchronization Functions */

/**
 * @brief Convert touch button source to corresponding LED index
 */
static uint8_t touch_source_to_led_index(bsp_button_source_t touch_source)
{
    switch (touch_source) {
        case BSP_INPUT_TOUCH_1: return BSP_LED_INDEX_5;  // Bottom Right
        case BSP_INPUT_TOUCH_2: return BSP_LED_INDEX_4;  // Right
        case BSP_INPUT_TOUCH_3: return BSP_LED_INDEX_3;  // Top Right
        case BSP_INPUT_TOUCH_4: return BSP_LED_INDEX_2;  // Top Left
        case BSP_INPUT_TOUCH_5: return BSP_LED_INDEX_1;  // Left
        case BSP_INPUT_TOUCH_6: return BSP_LED_INDEX_0;  // Bottom Left
        default: return 0xFF;  // Invalid
    }
}

