Horion0415/xiaozhi-esp32/components/esp32_c5_sensairpanel/esp32_c5_sensairpanel.c
esp_err_t bsp_led_set_for_touch(bsp_button_source_t touch_source, uint32_t color)
{
    uint8_t led_index = touch_source_to_led_index(touch_source);
    if (led_index == 0xFF) {
        return ESP_ERR_INVALID_ARG;
    }
    
    return bsp_led_set_color(led_index, color);
}

esp_err_t bsp_led_set_rgb_for_touch(bsp_button_source_t touch_source, uint8_t r, uint8_t g, uint8_t b)
{
    uint8_t led_index = touch_source_to_led_index(touch_source);
    if (led_index == 0xFF) {
        return ESP_ERR_INVALID_ARG;
    }
    
    return bsp_led_set_rgb(led_index, r, g, b);
}

esp_err_t bsp_led_clear_for_touch(bsp_button_source_t touch_source)
{
    uint8_t led_index = touch_source_to_led_index(touch_source);
    if (led_index == 0xFF) {
        return ESP_ERR_INVALID_ARG;
    }
    
    return bsp_led_clear(led_index);
}

/* LED Matrix (16x16 on BSP_RGB_EXT_CTRL) */
static inline uint16_t led_mx_index(uint16_t x, uint16_t y)
{
    // serpentine mapping, row-major, origin: top-left
    bool serp = true;
    if (serp && (y % 2)) {
        return y * BSP_LED_MATRIX_COLS + (BSP_LED_MATRIX_COLS - 1 - x);
    }
    return y * BSP_LED_MATRIX_COLS + x;
}

static inline uint32_t led_mx_apply_brightness(uint32_t rgb)
{
    uint8_t r = (rgb >> 16) & 0xFF;
    uint8_t g = (rgb >> 8) & 0xFF;
    uint8_t b = rgb & 0xFF;
    r = (r * s_led_mx_brightness) / 255;
    g = (g * s_led_mx_brightness) / 255;
    b = (b * s_led_mx_brightness) / 255;
    return ((uint32_t)r << 16) | ((uint32_t)g << 8) | b;
}

static void led_mx_refresh_hw(void)
{
    if (!s_led_mx) return;
    for (uint16_t y = 0; y < BSP_LED_MATRIX_ROWS; ++y) {
        for (uint16_t x = 0; x < BSP_LED_MATRIX_COLS; ++x) {
            uint16_t idx = led_mx_index(x, y);
            uint32_t c = led_mx_apply_brightness(s_led_mx_fb[idx]);
            uint8_t r = (c >> 16) & 0xFF;
            uint8_t g = (c >> 8) & 0xFF;
            uint8_t b = c & 0xFF;
            led_strip_set_pixel(s_led_mx, idx, r, g, b);
        }
    }
    led_strip_refresh(s_led_mx);
}

static void led_mx_timer_cb(void *arg)
{
    if (!s_led_mx) return;
    switch (s_led_mx_effect) {
        case BSP_LED_MX_EFFECT_BREATH: {
            // global brightness breath
            float t = (s_led_mx_phase % 200) / 200.0f; // 0..1
            float s = (sinf(t * 2 * 3.1415926f) + 1.0f) * 0.5f; // 0..1
            s_led_mx_brightness = (uint8_t)(s * 255);
            break;
        }
        case BSP_LED_MX_EFFECT_RAINBOW: {
            for (uint16_t y = 0; y < BSP_LED_MATRIX_ROWS; ++y) {
                for (uint16_t x = 0; x < BSP_LED_MATRIX_COLS; ++x) {
                    uint16_t idx = led_mx_index(x, y);
                    uint16_t hue = (s_led_mx_phase * 4 + (x + y) * 8) % 360;
                    // simple HSV to RGB (sat=255, val=255)
                    uint8_t region = hue / 60;
                    uint8_t rem = (hue % 60) * 255 / 60;
                    uint8_t q = 255 - rem, t2 = rem;
                    uint8_t r,g,b;
                    switch(region){
                        case 0: r=255; g=t2; b=0; break;
                        case 1: r=q; g=255; b=0; break;
                        case 2: r=0; g=255; b=t2; break;
                        case 3: r=0; g=q; b=255; break;
                        case 4: r=t2; g=0; b=255; break;
                        default: r=255; g=0; b=q; break;
                    }
                    s_led_mx_fb[idx] = ((uint32_t)r<<16)|((uint32_t)g<<8)|b;
                }
            }
            break;
        }
        case BSP_LED_MX_EFFECT_SCAN: {
            // horizontal scan white dot
            uint16_t pos = s_led_mx_phase % BSP_LED_MATRIX_COLS;
            for (uint16_t y = 0; y < BSP_LED_MATRIX_ROWS; ++y) {
                for (uint16_t x = 0; x < BSP_LED_MATRIX_COLS; ++x) {
                    uint16_t idx = led_mx_index(x, y);
                    s_led_mx_fb[idx] = (x == pos) ? 0xFFFFFF : 0x000000;
                }
            }
            break;
        }
        default:
            break;
    }
    s_led_mx_phase++;
    led_mx_refresh_hw();
}

esp_err_t bsp_led_matrix_init(void)
{
    if (s_led_mx) return ESP_OK;
    led_strip_config_t cfg = {
        .strip_gpio_num = BSP_RGB_EXT_CTRL,
        .max_leds = BSP_LED_MATRIX_ROWS * BSP_LED_MATRIX_COLS,
        .led_model = LED_MODEL_WS2812,
        .flags.invert_out = false,
    };
    led_strip_rmt_config_t rmt = {
        .clk_src = RMT_CLK_SRC_DEFAULT,
        .resolution_hz = 10 * 1000 * 1000,
        .flags.with_dma = false,
    };
    esp_err_t e = led_strip_new_rmt_device(&cfg, &rmt, &s_led_mx);
    if (e != ESP_OK) return e;
    for (size_t i = 0; i < BSP_LED_MATRIX_ROWS * BSP_LED_MATRIX_COLS; ++i) s_led_mx_fb[i] = 0;
    led_strip_clear(s_led_mx);

    esp_timer_create_args_t targs = {
        .callback = led_mx_timer_cb,
        .arg = NULL,
        .name = "led_mx",
    };
    ESP_ERROR_CHECK(esp_timer_create(&targs, &s_led_mx_timer));
    ESP_LOGI(TAG, "LED matrix initialized: %ux%u on GPIO %d", BSP_LED_MATRIX_COLS, BSP_LED_MATRIX_ROWS, BSP_RGB_EXT_CTRL);
    return ESP_OK;
}

esp_err_t bsp_led_matrix_deinit(void)
{
    if (s_led_mx_timer) {
        esp_timer_stop(s_led_mx_timer);
        esp_timer_delete(s_led_mx_timer);
        s_led_mx_timer = NULL;
    }
    if (s_led_mx) {
        led_strip_del(s_led_mx);
        s_led_mx = NULL;
    }
    return ESP_OK;
}

esp_err_t bsp_led_matrix_set_pixel(uint16_t x, uint16_t y, uint32_t rgb)
{
    if (x >= BSP_LED_MATRIX_COLS || y >= BSP_LED_MATRIX_ROWS) return ESP_ERR_INVALID_ARG;
    s_led_mx_fb[led_mx_index(x,y)] = rgb;
    return ESP_OK;
}

esp_err_t bsp_led_matrix_fill(uint32_t rgb)
{
    for (size_t i = 0; i < BSP_LED_MATRIX_ROWS * BSP_LED_MATRIX_COLS; ++i) s_led_mx_fb[i] = rgb;
    return ESP_OK;
}

esp_err_t bsp_led_matrix_clear(void)
{
    return bsp_led_matrix_fill(0);
}

esp_err_t bsp_led_matrix_refresh(void)
{
    if (!s_led_mx) return ESP_ERR_INVALID_STATE;
    led_mx_refresh_hw();
    return ESP_OK;
}

esp_err_t bsp_led_matrix_set_brightness(uint8_t level)
{
    s_led_mx_brightness = level;
    return ESP_OK;
}

esp_err_t bsp_led_matrix_start_effect(bsp_led_matrix_effect_t effect, uint32_t color, uint16_t speed_ms)
{
    if (!s_led_mx || !s_led_mx_timer) return ESP_ERR_INVALID_STATE;
    s_led_mx_effect = effect;
    s_led_mx_phase = 0;
    if (effect == BSP_LED_MX_EFFECT_STATIC) {
        // fill with color and stop timer
        bsp_led_matrix_fill(color);
        led_mx_refresh_hw();
        esp_timer_stop(s_led_mx_timer);
        return ESP_OK;
    }
    esp_timer_stop(s_led_mx_timer);
    return esp_timer_start_periodic(s_led_mx_timer, (uint64_t)speed_ms * 1000ULL);
}

esp_err_t bsp_led_matrix_stop_effect(void)
{
    if (!s_led_mx_timer) return ESP_OK;
    esp_timer_stop(s_led_mx_timer);
    return ESP_OK;
}




