Horion0415/xiaozhi-esp32/components/esp32_c5_sensairpanel/esp32_c5_sensairpanel.c
/* Audio */
esp_codec_dev_handle_t bsp_audio_codec_speaker_init(void)
{
    if (speaker_dev_handle) {
        return speaker_dev_handle;
    }
    i2s_chan_config_t chan_cfg = I2S_CHANNEL_DEFAULT_CONFIG(I2S_NUM_0, I2S_ROLE_MASTER);
    chan_cfg.auto_clear = true;
    BSP_ERROR_CHECK_RETURN_NULL(i2s_new_channel(&chan_cfg, &i2s_tx_chan, NULL));

    i2s_pdm_tx_config_t pdm_cfg = BSP_I2S_DUPLEX_MONO_CFG(BSP_OUTPUT_SAMPLE_RATE, BSP_PDM_SPEAK_P_GPIO);
    pdm_cfg.clk_cfg.up_sample_fs = BSP_OUTPUT_SAMPLE_RATE / 100;
    pdm_cfg.slot_cfg.sd_scale = I2S_PDM_SIG_SCALING_MUL_4;
    pdm_cfg.slot_cfg.hp_scale = I2S_PDM_SIG_SCALING_MUL_4;
    pdm_cfg.slot_cfg.lp_scale = I2S_PDM_SIG_SCALING_MUL_4;
    pdm_cfg.slot_cfg.sinc_scale = I2S_PDM_SIG_SCALING_MUL_4;

    BSP_ERROR_CHECK_RETURN_NULL(i2s_channel_init_pdm_tx_mode(i2s_tx_chan, &pdm_cfg));

    audio_codec_i2s_cfg_t i2s_cfg = {
        .port = I2S_NUM_0,
        .rx_handle = NULL,
        .tx_handle = i2s_tx_chan,
    };

    i2s_data_if = audio_codec_new_i2s_data(&i2s_cfg);
    BSP_ERROR_CHECK_RETURN_NULL(i2s_channel_enable(i2s_tx_chan));

    if (BSP_PA_CTL_GPIO != GPIO_NUM_NC) {
        gpio_config_t io_conf = {
            .intr_type = GPIO_INTR_DISABLE,
            .mode = GPIO_MODE_OUTPUT,
            .pin_bit_mask = (1ULL << BSP_PA_CTL_GPIO),
            .pull_down_en = GPIO_PULLDOWN_DISABLE,
            .pull_up_en = GPIO_PULLUP_DISABLE,
        };
        gpio_config(&io_conf);
    }
    gpio_set_drive_capability(BSP_PDM_SPEAK_P_GPIO, GPIO_DRIVE_CAP_0);

    if(BSP_PDM_SPEAK_N_GPIO != GPIO_NUM_NC){
        // ESP_LOGI(TAG, "BSP_PDM_SPEAK_N_GPIO: %d", BSP_PDM_SPEAK_N_GPIO);
        // gpio_config_t io_conf_n = {
        //     .intr_type = GPIO_INTR_DISABLE,
        //     .mode = GPIO_MODE_OUTPUT,
        //     .pin_bit_mask = (1ULL << BSP_PDM_SPEAK_N_GPIO),
        //     .pull_down_en = GPIO_PULLDOWN_DISABLE,
        //     .pull_up_en = GPIO_PULLUP_DISABLE,
        // };
        // gpio_config(&io_conf_n);
        PIN_FUNC_SELECT(IO_MUX_GPIO4_REG, PIN_FUNC_GPIO);
        gpio_set_direction(BSP_PDM_SPEAK_N_GPIO, GPIO_MODE_OUTPUT);
        esp_rom_gpio_connect_out_signal(BSP_PDM_SPEAK_N_GPIO, I2SO_SD_OUT_IDX, 1, 0); //反转输出 SD OUT 信号
        gpio_set_drive_capability(BSP_PDM_SPEAK_N_GPIO, GPIO_DRIVE_CAP_0);
    }

    esp_codec_dev_cfg_t codec_dev_cfg = {
        .dev_type = ESP_CODEC_DEV_TYPE_OUT,
        .data_if = i2s_data_if,
        .codec_if = NULL,
    };
    speaker_dev_handle = esp_codec_dev_new(&codec_dev_cfg);
    return speaker_dev_handle;
}

static size_t read_wav_data_chunk(FILE *fp, long *data_offset, uint32_t *data_size)
{
    fseek(fp, 12, SEEK_SET);
    while (1) {
        char id[4];
        uint32_t size = 0;
        if (fread(id, 1, 4, fp) != 4) return 0;
        if (fread(&size, 1, 4, fp) != 4) return 0;
        if (memcmp(id, "data", 4) == 0) {
            *data_offset = ftell(fp);
            *data_size = size;
            return size;
        }
        fseek(fp, size, SEEK_CUR);
    }
}

esp_err_t bsp_wav_init_async(void)
{
    if (s_wav_task_handle) {
        return ESP_OK;
    }
    
    s_wav_queue = xQueueCreate(8, sizeof(wav_play_request_t));
    if (!s_wav_queue) {
        return ESP_FAIL;
    }
    
    s_wav_mutex = xSemaphoreCreateMutex();
    if (!s_wav_mutex) {
        vQueueDelete(s_wav_queue);
        s_wav_queue = NULL;
        return ESP_FAIL;
    }
    
    BaseType_t ret = xTaskCreate(wav_play_task, "wav_play", 4096, NULL, 5, &s_wav_task_handle);
    if (ret != pdPASS) {
        vQueueDelete(s_wav_queue);
        vSemaphoreDelete(s_wav_mutex);
        s_wav_queue = NULL;
        s_wav_mutex = NULL;
        return ESP_FAIL;
    }
    
    return ESP_OK;
}

esp_err_t bsp_wav_play_file_async(const char *file_path)
{
    if (!file_path) return ESP_ERR_INVALID_ARG;
    
    if (bsp_wav_init_async() != ESP_OK) {
        return ESP_FAIL;
    }
    
    wav_play_request_t request = {0};
    strncpy(request.file_path, file_path, sizeof(request.file_path) - 1);
    request.stop_current = true;
    
    UBaseType_t queue_items = uxQueueMessagesWaiting(s_wav_queue);
    if (queue_items > 4) {
        xQueueReset(s_wav_queue);
    }
    
    if (xQueueSend(s_wav_queue, &request, 0) != pdTRUE) {
        xQueueReset(s_wav_queue);
        return xQueueSend(s_wav_queue, &request, 0) == pdTRUE ? ESP_OK : ESP_FAIL;
    }
    
    return ESP_OK;
}

esp_err_t bsp_wav_play_file(const char *file_path)
{
    return bsp_wav_play_file_async(file_path);
}

esp_err_t bsp_wav_stop(void)
{
    if (s_wav_queue) {
        xQueueReset(s_wav_queue);
    }
    s_wav_playing = false;
    return ESP_OK;
}

esp_err_t bsp_wav_deinit_async(void)
{
    if (s_wav_task_handle) {
        s_wav_task_running = false;
        vTaskDelay(pdMS_TO_TICKS(50));
        s_wav_task_handle = NULL;
    }
    
    if (s_wav_queue) {
        vQueueDelete(s_wav_queue);
        s_wav_queue = NULL;
    }
    
    if (s_wav_mutex) {
        vSemaphoreDelete(s_wav_mutex);
        s_wav_mutex = NULL;
    }
    
    s_wav_playing = false;
    return ESP_OK;
}

esp_codec_dev_handle_t bsp_audio_codec_microphone_init(void)
{
    audio_codec_adc_cfg_t cfg = DEFAULT_AUDIO_CODEC_ADC_MONO_CFG(BSP_ADC_MIC_CHANNEL, BSP_INPUT_SAMPLE_RATE);
    const audio_codec_data_if_t *adc_if = audio_codec_new_adc_data(&cfg);

    esp_codec_dev_cfg_t codec_dev_cfg = {
        .dev_type = ESP_CODEC_DEV_TYPE_IN,
        .data_if = adc_if,
    };

    return esp_codec_dev_new(&codec_dev_cfg);
}

static esp_err_t bsp_audio_mute_function(AUDIO_PLAYER_MUTE_SETTING setting)
{
    esp_err_t ret = ESP_OK;
    
    if (speaker_dev_handle && speaker_device_opened) {
        ret = esp_codec_dev_set_out_mute(speaker_dev_handle, setting == AUDIO_PLAYER_MUTE);
    }
    
    if (BSP_PA_CTL_GPIO != GPIO_NUM_NC) {
        gpio_set_level(BSP_PA_CTL_GPIO, setting == AUDIO_PLAYER_MUTE ? 0 : 1);
    }
    
    return ret;
}

esp_err_t bsp_audio_read(void *buffer, size_t len, size_t *bytes_read, uint32_t timeout_ms)
{
    if (!buffer || !bytes_read) {
        return ESP_ERR_INVALID_ARG;
    }
    
    // Initialize microphone device if not already done
    if (!microphone_dev_handle) {
        microphone_dev_handle = bsp_audio_codec_microphone_init();
        if (!microphone_dev_handle) {
            *bytes_read = 0;
            return ESP_ERR_INVALID_STATE;
        }
    }
    
    // Open microphone device if not already opened
    if (!microphone_device_opened) {
        esp_codec_dev_sample_info_t fs = {
            .sample_rate = BSP_INPUT_SAMPLE_RATE,
            .channel = 1,
            .bits_per_sample = 16,
        };
        
        esp_err_t ret = esp_codec_dev_open(microphone_dev_handle, &fs);
        if (ret != ESP_OK) {
            *bytes_read = 0;
            return ret;
        }
        microphone_device_opened = true;
    }
    
    // Read audio data from microphone
    esp_err_t ret = esp_codec_dev_read(microphone_dev_handle, buffer, len);
    if (ret == ESP_OK) {
        *bytes_read = len;
    } else {
        *bytes_read = 0;
    }
    
    return ret;
}

static esp_err_t bsp_audio_write_function(void *buffer, size_t len, size_t *bytes_written, uint32_t timeout_ms)
{
    if (!speaker_dev_handle || !speaker_device_opened) {
        *bytes_written = 0;
        return ESP_FAIL;
    }
    
    esp_err_t ret = esp_codec_dev_write(speaker_dev_handle, buffer, len);
    if (ret == ESP_OK) {
        *bytes_written = len;
    } else {
        *bytes_written = 0;
    }
    return ret;
}

static esp_err_t bsp_audio_reconfig_clock(uint32_t rate, uint32_t bits_cfg, i2s_slot_mode_t ch)
{
    if (!speaker_dev_handle) return ESP_FAIL;
    
