Horion0415/xiaozhi-esp32/components/esp32_c5_sensairpanel/esp32_c5_sensairpanel.c
    esp_codec_dev_sample_info_t fs = {
        .sample_rate = rate,
        .channel = ch,
        .bits_per_sample = bits_cfg,
    };
    
    if (speaker_device_opened) {
        esp_codec_dev_close(speaker_dev_handle);
        speaker_device_opened = false;
    }
    
    esp_err_t ret = esp_codec_dev_open(speaker_dev_handle, &fs);
    if (ret == ESP_OK) {
        speaker_device_opened = true;
        bsp_audio_set_volume(current_volume);
        if (BSP_PA_CTL_GPIO != GPIO_NUM_NC) {
            gpio_set_level(BSP_PA_CTL_GPIO, 1);
        }
    }
    return ret;
}

static void bsp_audio_player_callback(audio_player_cb_ctx_t *ctx)
{
    if (audio_callback) {
        ctx->user_ctx = audio_callback_user_data;
        audio_callback(ctx);
    }
}

esp_err_t bsp_audio_player_init(void)
{
    if (audio_player_initialized) return ESP_OK;
    
    if (!speaker_dev_handle) {
        speaker_dev_handle = bsp_audio_codec_speaker_init();
        if (!speaker_dev_handle) return ESP_FAIL;
    }
    
    esp_codec_dev_sample_info_t fs = {
        .sample_rate = BSP_OUTPUT_SAMPLE_RATE,
        .channel = 1,
        .bits_per_sample = 16,
    };
    
    esp_err_t ret = esp_codec_dev_open(speaker_dev_handle, &fs);
    if (ret == ESP_OK) {
        speaker_device_opened = true;
        bsp_audio_set_volume(current_volume);
        if (BSP_PA_CTL_GPIO != GPIO_NUM_NC) {
            gpio_set_level(BSP_PA_CTL_GPIO, 1);
        }
    } else {
        return ret;
    }
    
    audio_player_config_t config = {
        .mute_fn = bsp_audio_mute_function,
        .write_fn = bsp_audio_write_function,
        .clk_set_fn = bsp_audio_reconfig_clock,
        .priority = 5,
    };
    
    ret = audio_player_new(config);
    if (ret == ESP_OK) {
        audio_player_callback_register(bsp_audio_player_callback, NULL);
        audio_player_initialized = true;
    }
    return ret;
}

esp_err_t bsp_audio_player_deinit(void)
{
    if (!audio_player_initialized) return ESP_OK;
    
    esp_err_t ret = audio_player_delete();
    
    if (speaker_device_opened && speaker_dev_handle) {
        esp_codec_dev_close(speaker_dev_handle);
        speaker_device_opened = false;
    }
    
    if (BSP_PA_CTL_GPIO != GPIO_NUM_NC) {
        gpio_set_level(BSP_PA_CTL_GPIO, 0);
    }
    
    audio_player_initialized = false;
    return ret;
}

esp_err_t bsp_audio_file_iterator_init(const char *path, file_iterator_instance_t **instance)
{
    if (!path || !instance) return ESP_ERR_INVALID_ARG;
    
    file_iterator_instance_t *iter = file_iterator_new(path);
    if (!iter) return ESP_FAIL;
    
    *instance = iter;
    return ESP_OK;
}

esp_err_t bsp_audio_play_file(const char *file_path)
{
    if (!file_path) return ESP_ERR_INVALID_ARG;
    
    FILE *fp = fopen(file_path, "rb");
    if (!fp) return ESP_FAIL;
    
    return audio_player_play(fp);
}

esp_err_t bsp_audio_play_index(file_iterator_instance_t *instance, int index)
{
    if (!instance) return ESP_ERR_INVALID_ARG;
    
    char filename[128];
    if (file_iterator_get_full_path_from_index(instance, index, filename, sizeof(filename)) == 0) {
        return ESP_FAIL;
    }
    
    FILE *fp = fopen(filename, "rb");
    if (!fp) return ESP_FAIL;
    
    return audio_player_play(fp);
}

void bsp_audio_register_callback(audio_player_cb_t cb, void *user_data)
{
    audio_callback = cb;
    audio_callback_user_data = user_data;
}

esp_err_t bsp_audio_set_volume(uint8_t volume)
{
    if (volume < BSP_AUDIO_VOLUME_MIN) {
        volume = BSP_AUDIO_VOLUME_MIN;
    } else if (volume > BSP_AUDIO_VOLUME_MAX) {
        volume = BSP_AUDIO_VOLUME_MAX;
    }
    
    current_volume = volume;
    
    if (speaker_dev_handle && speaker_device_opened) {
        return esp_codec_dev_set_out_vol(speaker_dev_handle, volume);
    }
    
    return ESP_OK;
}

esp_err_t bsp_audio_get_volume(uint8_t *volume)
{
    if (!volume) return ESP_ERR_INVALID_ARG;
    
    *volume = current_volume;
    return ESP_OK;
}




/* SPIFFS */
esp_err_t bsp_spiffs_mount(void)
{
    esp_vfs_spiffs_conf_t conf = {
        .base_path = CONFIG_BSP_SPIFFS_MOUNT_POINT,
        .partition_label = CONFIG_BSP_SPIFFS_PARTITION_LABEL,
        .max_files = CONFIG_BSP_SPIFFS_MAX_FILES,
#ifdef CONFIG_BSP_SPIFFS_FORMAT_ON_MOUNT_FAIL
        .format_if_mount_failed = true,
#else
        .format_if_mount_failed = false,
#endif
    };

    esp_err_t ret_val = esp_vfs_spiffs_register(&conf);

    BSP_ERROR_CHECK_RETURN_ERR(ret_val);

    size_t total = 0, used = 0;
    ret_val = esp_spiffs_info(conf.partition_label, &total, &used);
    if (ret_val != ESP_OK) {
        ESP_LOGE(TAG, "Failed to get SPIFFS partition information (%s)", esp_err_to_name(ret_val));
    } else {
        ESP_LOGI(TAG, "Partition size: total: %d, used: %d", total, used);
    }

    return ret_val;
}

esp_err_t bsp_spiffs_unmount(void)
{
    return esp_vfs_spiffs_unregister(CONFIG_BSP_SPIFFS_PARTITION_LABEL);
}




/* Display */
static lv_display_t *bsp_display_lcd_init(const bsp_display_cfg_t *cfg)
{
    assert(cfg != NULL);
    esp_lcd_panel_io_handle_t io_handle = NULL;
    esp_lcd_panel_handle_t panel_handle = NULL;
    const bsp_display_config_t bsp_disp_cfg = {
        .max_transfer_sz = BSP_LCD_H_RES * 10 * sizeof(uint16_t),
    };
    BSP_ERROR_CHECK_RETURN_NULL(bsp_display_new(&bsp_disp_cfg, &panel_handle, &io_handle));

    /* Add LCD screen */
    ESP_LOGD(TAG, "Add LCD screen");
    const lvgl_port_display_cfg_t disp_cfg = {
        .io_handle = io_handle,
        .panel_handle = panel_handle,
        .buffer_size = cfg->buffer_size,
        .double_buffer = cfg->double_buffer,
        .hres = BSP_LCD_H_RES,
        .vres = BSP_LCD_V_RES,
        .monochrome = false,
        /* Rotation values must be same as used in esp_lcd for initial settings of the screen */
        .rotation = {
            .swap_xy = false,
            .mirror_x = true,
            .mirror_y = false,
        },
        .flags = {
            .buff_dma = cfg->flags.buff_dma,
            .buff_spiram = cfg->flags.buff_spiram,
#if LVGL_VERSION_MAJOR >= 9
            .swap_bytes = (BSP_LCD_BIGENDIAN ? true : false),
#endif
        }
    };

    return lvgl_port_add_disp(&disp_cfg);
}

// Bit number used to represent command and parameter
#define LCD_CMD_BITS           8
#define LCD_PARAM_BITS         8

esp_err_t bsp_display_brightness_init(void)
{
    // Configure backlight GPIO as output and default OFF
    gpio_config_t io = {
        .pin_bit_mask = (1ULL << BSP_LCD_BACKLIGHT),
        .mode = GPIO_MODE_OUTPUT,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    ESP_RETURN_ON_ERROR(gpio_config(&io), TAG, "Backlight GPIO config failed");
    gpio_set_level(BSP_LCD_BACKLIGHT, 0);
    return ESP_OK;
}

esp_err_t bsp_display_brightness_set(int brightness_percent)
{
    // Any positive value turns on, zero or negative turns off
    int level = (brightness_percent > 0) ? 1 : 0;
    gpio_set_level(BSP_LCD_BACKLIGHT, level);
    return ESP_OK;
}

