Horion0415/xiaozhi-esp32/components/esp32_c5_sensairpanel/esp32_c5_sensairpanel.c
    if (bit_position < 2 || bit_position > 7) {
        return ESP_ERR_INVALID_ARG;
    }
    
    return ESP_OK;
}

/**
 * @brief Check if touch hardware is available and functional
 */
bool bsp_touch_hardware_available(void)
{
    return touch_hardware_available;
}

/**
 * @brief Custom button get key value function for touch buttons
 */
static uint8_t bsp_touch_custom_get_key_value(void *param)
{
    uint32_t bit_position = (uint32_t)param;
    
    if (!touch_hardware_available || bit_position < 2 || bit_position > 7) {
        return 0;
    }
    
    uint32_t touch_index = bit_position - 2;
    if (touch_index >= TOUCH_BUTTON_NUM) {
        return 0;
    }
    
    return touch_ic_bs8112a3_get_key_value(touch_index) ? 1 : 0;
}

/**
 * @brief Internal function to initialize touch buttons
 * 
 * Touch Button Physical Layout:
 *          4 (Top Left)    3 (Top Right)
 *                     \   /
 *                      \ /
 *       5 (Left) -------o------- 2 (Right)
 *                      / \
 *                     /   \
 *          6 (Bottom Left) 1 (Bottom Right)
 * 
 * LED-Touch Button Mapping:
 * - Touch Button 1 (Bottom Right) <-> LED 0 (Bottom Right)
 * - Touch Button 2 (Right)        <-> LED 1 (Right)
 * - Touch Button 3 (Top Right)    <-> LED 2 (Top Right)
 * - Touch Button 4 (Top Left)     <-> LED 3 (Top Left)
 * - Touch Button 5 (Left)         <-> LED 4 (Left)
 * - Touch Button 6 (Bottom Left)  <-> LED 5 (Bottom Left)
 */
typedef struct {
    button_driver_t base;
    uint32_t bit_position;
} bs8112_button_driver_t;

static uint8_t bs8112_button_get_key_level(button_driver_t *driver)
{
    bs8112_button_driver_t *d = (bs8112_button_driver_t *)driver;
    return bsp_touch_custom_get_key_value((void *)d->bit_position);
}

static esp_err_t bs8112_button_del(button_driver_t *driver)
{
    free(driver);
    return ESP_OK;
}

static button_driver_t *bs8112_new_driver(uint32_t bit_position)
{
    bs8112_button_driver_t *drv = (bs8112_button_driver_t *)calloc(1, sizeof(bs8112_button_driver_t));
    if (!drv) {
        return NULL;
    }
    drv->base.enable_power_save = false;
    drv->base.get_key_level = bs8112_button_get_key_level;
    drv->base.enter_power_save = NULL;
    drv->base.del = bs8112_button_del;
    drv->bit_position = bit_position;
    return &drv->base;
}

static void bsp_button_event_handler(void *button_handle, void *usr_data);

static esp_err_t bsp_touch_button_init_internal(void)
{
    if (!s_i2c_bus_handle) {
        ESP_LOGE(TAG, "I2C bus not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    ESP_LOGI(TAG, "Initializing touch buttons with interrupt mode");
    
    // Initialize touch IC with interrupt mode (using BSP_TOUCH_INT pin)
    // GPIO ISR service installation is now handled inside touch_ic_bs8112a3_init()
    touch_ic_bs8112a3_config_t touch_config = {
        .i2c_bus_handle = s_i2c_bus_handle,
        .device_address = BS8112A3_I2C_ADDR,
        .scl_speed_hz = BSP_I2C_CLK_SPEED,
        .interrupt_pin = BSP_TOUCH_INT,  // Enable interrupt mode
    };
    
    esp_err_t ret = touch_ic_bs8112a3_init(&touch_config);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to initialize touch IC");
        return ret;
    }
    
    button_config_t btn_cfg = {
        .long_press_time = 1000,
        .short_press_time = 180,
    };
    
    uint8_t success_count = 0;
    
    for (int i = 0; i < TOUCH_BUTTON_NUM; i++) {
        uint32_t bit_position = (uint32_t)(i + 2);
        bsp_button_source_t source = (bsp_button_source_t)(BSP_INPUT_TOUCH_1 + i);

        button_driver_t *driver = bs8112_new_driver(bit_position);
        if (!driver) {
            continue;
        }

        button_handle_t btn_handle = NULL;
        esp_err_t cret = iot_button_create(&btn_cfg, driver, &btn_handle);
        if (cret != ESP_OK) {
            if (driver && driver->del) {
                driver->del(driver);
            }
            continue;
        }

        bsp_button_handles[source] = btn_handle;
        iot_button_register_cb(btn_handle, BUTTON_PRESS_DOWN, NULL, bsp_button_event_handler, (void *)source);
        iot_button_register_cb(btn_handle, BUTTON_PRESS_UP, NULL, bsp_button_event_handler, (void *)source);
        iot_button_register_cb(btn_handle, BUTTON_SINGLE_CLICK, NULL, bsp_button_event_handler, (void *)source);
        iot_button_register_cb(btn_handle, BUTTON_LONG_PRESS_START, NULL, bsp_button_event_handler, (void *)source);
        iot_button_register_cb(btn_handle, BUTTON_DOUBLE_CLICK, NULL, bsp_button_event_handler, (void *)source);

        success_count++;
    }
    
    if (success_count == 0) {
        ESP_LOGE(TAG, "No touch buttons registered successfully");
        return ESP_FAIL;
    }
    
    ESP_LOGI(TAG, "Touch buttons initialized: %d/%d functional (interrupt mode)", success_count, TOUCH_BUTTON_NUM);
    return ESP_OK;
}

/**
 * @brief Internal function to deinitialize touch buttons
 */
static esp_err_t bsp_touch_button_deinit_internal(void)
{
    // Unregister touch buttons
    for (int i = 0; i < TOUCH_BUTTON_NUM; i++) {
        bsp_button_source_t source = BSP_INPUT_TOUCH_1 + i;
        if (bsp_button_handles[source] != NULL) {
            iot_button_delete(bsp_button_handles[source]);
            bsp_button_handles[source] = NULL;
        }
    }
    
    // Deinitialize touch IC
    esp_err_t ret = touch_ic_bs8112a3_deinit();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to deinitialize touch IC");
    }
    
    return ret;
}

/* Button Management */
static void bsp_button_event_handler(void *button_handle, void *usr_data)
{
    bsp_button_source_t source = (bsp_button_source_t)usr_data;
    button_event_t btn_event = iot_button_get_event(button_handle);
    
    bsp_button_event_t bsp_event;
    switch (btn_event) {
        case BUTTON_PRESS_DOWN:      bsp_event = BSP_BUTTON_EVENT_PRESS_DOWN; break;
        case BUTTON_PRESS_UP:        bsp_event = BSP_BUTTON_EVENT_PRESS_UP; break;
        case BUTTON_SINGLE_CLICK:    bsp_event = BSP_BUTTON_EVENT_SHORT_PRESS; break;
        case BUTTON_LONG_PRESS_START: bsp_event = BSP_BUTTON_EVENT_LONG_PRESS; break;
        case BUTTON_DOUBLE_CLICK:    bsp_event = BSP_BUTTON_EVENT_DOUBLE_CLICK; break;
        default: return;
    }
    
