Horion0415/xiaozhi-esp32/components/esp32_c5_sensairpanel/esp32_c5_sensairpanel.c
    if (global_button_callback) {
        global_button_callback(source, bsp_event, usr_data);
    }
}

esp_err_t bsp_button_init(bsp_button_callback_t callback)
{
    if (!callback) {
        return ESP_ERR_INVALID_ARG;
    }
    
    global_button_callback = callback;
    ESP_LOGI(TAG, "Initializing button management system");
    
    // Initialize I2C bus if not already initialized
    if (s_i2c_bus_handle == NULL) {
        bsp_i2c_config_t i2c_config = {
            .sda_io_num = BSP_I2C_SDA,
            .scl_io_num = BSP_I2C_SCL,
            .clk_speed = BSP_I2C_CLK_SPEED,
        };
        
        esp_err_t ret = bsp_i2c_init(&i2c_config);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to initialize I2C bus");
            return ret;
        }
    }
    
    // Try to initialize touch buttons
    esp_err_t ret = bsp_touch_button_init_internal();
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Touch hardware not available, continuing without touch");
        touch_hardware_available = false;
    } else {
        touch_hardware_available = true;
        ESP_LOGI(TAG, "Touch hardware initialized successfully");
    }
    
    // Try to initialize light sensor
    ret = bsp_light_sensor_init();
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Light sensor not available, continuing without light sensor");
    }
    
    ESP_LOGI(TAG, "Button management system initialized (touch: %s, light sensor: %s)", 
             touch_hardware_available ? "enabled" : "disabled",
             light_sensor_available ? "enabled" : "disabled");
    return ESP_OK;
}

esp_err_t bsp_button_deinit(void)
{
    ESP_LOGI(TAG, "Deinitializing button management system");
    
    // Deinitialize touch buttons
    esp_err_t ret = bsp_touch_button_deinit_internal();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to deinitialize touch buttons");
    }
    
    // Clean up remaining button handles
    for (int i = 0; i < BSP_INPUT_MAX; i++) {
        if (bsp_button_handles[i] != NULL) {
            iot_button_delete(bsp_button_handles[i]);
            bsp_button_handles[i] = NULL;
        }
    }
    
    // Deinitialize light sensor
    esp_err_t light_ret = bsp_light_sensor_deinit();
    if (light_ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to deinitialize light sensor");
        if (ret == ESP_OK) {
            ret = light_ret;
        }
    }
    
    // Deinitialize I2C bus
    esp_err_t i2c_ret = bsp_i2c_deinit();
    if (i2c_ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to deinitialize I2C bus");
        if (ret == ESP_OK) {
            ret = i2c_ret;
        }
    }
    
    global_button_callback = NULL;
    touch_hardware_available = false;
    return ret;
}

esp_err_t bsp_button_register_source(bsp_button_source_t source, const button_config_t *config)
{
    if (source >= BSP_INPUT_MAX || bsp_button_handles[source] != NULL || config == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    button_driver_t *driver = NULL;
    if (source >= BSP_INPUT_TOUCH_1 && source <= BSP_INPUT_TOUCH_6) {
        uint32_t bit_position = (uint32_t)(2 + (source - BSP_INPUT_TOUCH_1));
        driver = bs8112_new_driver(bit_position);
    } else {
        driver = NULL;
    }

    if (!driver) {
        return ESP_ERR_NO_MEM;
    }

    button_handle_t handle = NULL;
    esp_err_t ret = iot_button_create(config, driver, &handle);
    if (ret != ESP_OK) {
        if (driver->del) {
            driver->del(driver);
        }
        return ret;
    }

    bsp_button_handles[source] = handle;
    iot_button_register_cb(handle, BUTTON_PRESS_DOWN, NULL, bsp_button_event_handler, (void *)source);
    iot_button_register_cb(handle, BUTTON_PRESS_UP, NULL, bsp_button_event_handler, (void *)source);
    iot_button_register_cb(handle, BUTTON_SINGLE_CLICK, NULL, bsp_button_event_handler, (void *)source);
    iot_button_register_cb(handle, BUTTON_LONG_PRESS_START, NULL, bsp_button_event_handler, (void *)source);
    iot_button_register_cb(handle, BUTTON_DOUBLE_CLICK, NULL, bsp_button_event_handler, (void *)source);
    return ESP_OK;
}




/* Light Sensor (RPR-0521) Management */
esp_err_t bsp_light_sensor_init(void)
{
    if (!s_i2c_bus_handle) {
        return ESP_ERR_INVALID_STATE;
    }
    
    light_sensor_rpr0521_config_t config = {
        .i2c_bus_handle = s_i2c_bus_handle,
        .device_address = BSP_LIGHT_SENSOR_I2C_ADDR,
        .scl_speed_hz = BSP_I2C_CLK_SPEED,
        .interrupt_pin = GPIO_NUM_NC,  // No interrupt support for now
    };
    
    esp_err_t ret = light_sensor_rpr0521_init(&config);
    if (ret != ESP_OK) {
        light_sensor_available = false;
        return ret;
    }
    
    light_sensor_available = true;
    return ESP_OK;
}

esp_err_t bsp_light_sensor_read_data0(uint16_t *light_value)
{
    if (!light_sensor_available) {
        return ESP_ERR_INVALID_STATE;
    }
    
    return light_sensor_rpr0521_read_als_data0(light_value);
}

esp_err_t bsp_light_sensor_read_data1(uint16_t *light_value)
{
    if (!light_sensor_available) {
        return ESP_ERR_INVALID_STATE;
    }
    
    return light_sensor_rpr0521_read_als_data1(light_value);
}

esp_err_t bsp_light_sensor_read_proximity(uint16_t *proximity_value)
{
    if (!light_sensor_available) {
        return ESP_ERR_INVALID_STATE;
    }
    
    return light_sensor_rpr0521_read_ps(proximity_value);
}

esp_err_t bsp_light_sensor_set_gain(uint8_t gain_level)
{
    if (!light_sensor_available || gain_level > 3) {
        return ESP_ERR_INVALID_ARG;
    }
    
    rpr0521_als_gain_t gain = (rpr0521_als_gain_t)gain_level;
    return light_sensor_rpr0521_set_als_gain(gain, gain);  // Set same gain for both DATA0 and DATA1
}

esp_err_t bsp_light_sensor_enable_proximity(bool enable)
{
    if (!light_sensor_available) {
        return ESP_ERR_INVALID_STATE;
    }
    
    return light_sensor_rpr0521_enable_ps(enable);
}

esp_err_t bsp_light_sensor_deinit(void)
{
    esp_err_t ret = light_sensor_rpr0521_deinit();
    light_sensor_available = false;
    return ret;
}

bool bsp_light_sensor_available(void)
{
    return light_sensor_available;
}




/* Infrared control state */
static bool g_ir_initialized = false;

esp_err_t bsp_ir_init(void)
{
    if (g_ir_initialized) {
        ESP_LOGW(TAG, "IR system already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    ESP_LOGI(TAG, "Initializing IR on GPIO %d", BSP_IR_TX_GPIO);
    ir_tx_config_t tx = {
        .tx_gpio = BSP_IR_TX_GPIO,
        .carrier_freq_hz = BSP_IR_CARRIER_FREQ,
        .resolution_hz = BSP_IR_RESOLUTION_HZ,
        .invert_signal = false,
    };
    esp_err_t ret = ir_remote_init(&tx, NULL);
    if (ret != ESP_OK) return ret;
    g_ir_initialized = true;
    return ESP_OK;
}

esp_err_t bsp_ir_deinit(void)
{
    if (!g_ir_initialized) return ESP_OK;
    esp_err_t ret = ir_remote_deinit();
    g_ir_initialized = false;
    return ret;
}

