Horion0415/xiaozhi-esp32/components/esp32_c5_sensairpanel/esp32_c5_sensairpanel.c
bool bsp_ir_is_initialized(void)
{
    return g_ir_initialized;
}

esp_err_t bsp_ir_ac_quick_on(const char *brand, const char *model)
{
    if (!g_ir_initialized || !brand || !model) return ESP_ERR_INVALID_STATE;
    ir_device_info_t info = { .category = IR_DEVICE_AC };
    strncpy(info.brand, brand, IR_MAX_BRAND_NAME_LEN - 1);
    strncpy(info.model, model, IR_MAX_MODEL_NAME_LEN - 1);
    ir_ac_status_t st = { .power = IR_AC_POWER_ON, .mode = IR_AC_MODE_AUTO, .temperature = 24, .wind_speed = IR_AC_WIND_AUTO, .swing = IR_AC_SWING_OFF };
    return ir_send_ac_command(&info, &st);
}

esp_err_t bsp_ir_ac_quick_off(const char *brand, const char *model)
{
    if (!g_ir_initialized || !brand || !model) return ESP_ERR_INVALID_STATE;
    ir_device_info_t info = { .category = IR_DEVICE_AC };
    strncpy(info.brand, brand, IR_MAX_BRAND_NAME_LEN - 1);
    strncpy(info.model, model, IR_MAX_MODEL_NAME_LEN - 1);
    ir_ac_status_t st = { .power = IR_AC_POWER_OFF, .mode = IR_AC_MODE_AUTO, .temperature = 24, .wind_speed = IR_AC_WIND_AUTO, .swing = IR_AC_SWING_OFF };
    return ir_send_ac_command(&info, &st);
}

esp_err_t bsp_ir_ac_set_temp(const char *brand, const char *model, uint8_t temperature)
{
    if (!g_ir_initialized || !brand || !model) return ESP_ERR_INVALID_STATE;
    if (temperature < 16 || temperature > 30) return ESP_ERR_INVALID_ARG;
    ir_device_info_t info = { .category = IR_DEVICE_AC };
    strncpy(info.brand, brand, IR_MAX_BRAND_NAME_LEN - 1);
    strncpy(info.model, model, IR_MAX_MODEL_NAME_LEN - 1);
    ir_ac_status_t st = { .power = IR_AC_POWER_ON, .mode = IR_AC_MODE_COOL, .temperature = temperature, .wind_speed = IR_AC_WIND_AUTO, .swing = IR_AC_SWING_OFF };
    return ir_send_ac_command(&info, &st);
}

esp_err_t bsp_ir_tv_key(const char *brand, const char *model, ir_tv_keycode_t key)
{
    if (!g_ir_initialized || !brand || !model) return ESP_ERR_INVALID_STATE;
    ir_device_info_t info = { .category = IR_DEVICE_TV };
    strncpy(info.brand, brand, IR_MAX_BRAND_NAME_LEN - 1);
    strncpy(info.model, model, IR_MAX_MODEL_NAME_LEN - 1);
    return ir_send_tv_key(&info, key);
}

esp_err_t bsp_ir_tv_digit(const char *brand, const char *model, uint8_t digit)
{
    if (digit > 9) return ESP_ERR_INVALID_ARG;
    if (!g_ir_initialized || !brand || !model) return ESP_ERR_INVALID_STATE;
    ir_device_info_t info = { .category = IR_DEVICE_TV };
    strncpy(info.brand, brand, IR_MAX_BRAND_NAME_LEN - 1);
    strncpy(info.model, model, IR_MAX_MODEL_NAME_LEN - 1);
    return ir_send_tv_digit(&info, digit);
}

esp_err_t bsp_ir_send_timing_us(const uint32_t *timing_pairs_us, size_t length)
{
    if (!g_ir_initialized) return ESP_ERR_INVALID_STATE;
    return ir_send_timing_us(timing_pairs_us, length);
}



/* Vibration sensor functions */
esp_err_t bsp_vibration_sensor_init(void)
{
    ESP_LOGI(TAG, "Initializing vibration sensor on GPIO %d", BSP_VIBRATION_SENSOR_PIN);
    
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << BSP_VIBRATION_SENSOR_PIN),
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,  
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE
    };
    
    esp_err_t ret = gpio_config(&io_conf);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to configure vibration sensor GPIO: %s", esp_err_to_name(ret));
        return ret;
    }
    
    ESP_LOGI(TAG, "Vibration sensor initialized successfully");
    return ESP_OK;
} 

bool bsp_vibration_sensor_read(void)
{
    vibration_detected = false;

    int current_level = gpio_get_level(BSP_VIBRATION_SENSOR_PIN);
    
    if (last_vibration_level != -1 && current_level != last_vibration_level) {
        vibration_level_change_count++;
        
        if (vibration_level_change_count >= g_vibration_sensitivity_threshold) {
            vibration_detected = true;
            vibration_level_change_count = 0;
        }
    }
    
    last_vibration_level = current_level;

    return vibration_detected;
}

esp_err_t bsp_vibration_sensor_set_sensitivity(int threshold)
{
    if (threshold < 1 || threshold > 50) {
        ESP_LOGE(TAG, "Invalid sensitivity threshold: %d (should be 1-50)", threshold);
        return ESP_ERR_INVALID_ARG;
    }
    
    g_vibration_sensitivity_threshold = threshold;
    
    vibration_level_change_count = 0;
    last_vibration_level = -1;
    vibration_detected = false;
    
    ESP_LOGI(TAG, "Vibration sensor sensitivity set to %d", threshold);
    return ESP_OK;
}



/* sleep & wakeup*/
bool bsp_woke_from_touch(void)
{
    return esp_sleep_get_wakeup_cause() == ESP_SLEEP_WAKEUP_GPIO;
}

static esp_err_t bsp_sleep_enable_touch_wakeup(esp_deepsleep_gpio_wake_up_mode_t level, bool use_internal_pullup)
{
    gpio_config_t cfg = {
        .pin_bit_mask = (1ULL << BSP_TOUCH_INT),
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = use_internal_pullup ? GPIO_PULLUP_ENABLE : GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    esp_err_t err = gpio_config(&cfg);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "gpio_config failed for touch INT (GPIO %d): %s", BSP_TOUCH_INT, esp_err_to_name(err));
        return err;
    }

    err = esp_deep_sleep_enable_gpio_wakeup(1ULL << BSP_TOUCH_INT, level);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "enable gpio wakeup failed: %s", esp_err_to_name(err));
        return err;
    }

    ESP_LOGI(TAG, "GPIO wakeup enabled on GPIO %d, level=%s, int_pullup=%d",
             BSP_TOUCH_INT, (level == ESP_GPIO_WAKEUP_GPIO_LOW) ? "LOW" : "HIGH",
             use_internal_pullup);
    return ESP_OK;
}

static esp_err_t bsp_sleep_enter_now(void)
{
    ESP_LOGI(TAG, "Entering deep sleep");
    esp_deep_sleep_start();
    return ESP_OK; // not reached
}

static esp_err_t bsp_sleep_wait_touch_release_and_enter(uint32_t timeout_ms)
{
    // Determine active level by checking configured wake level via a simple heuristic:
    // If line is low most of the time and wake level is LOW, treat 0 as active.
    // Here we use current level assumption: active when equals current active state
    const int active_low = 1; // default assumption for BS8112A3 INT
    const int active_level = active_low ? 0 : 1;

