Horion0415/xiaozhi-esp32/components/esp32_c5_sensairpanel/esp32_c5_sensairpanel.c
    uint64_t start_ms = esp_timer_get_time() / 1000ULL;
    while (gpio_get_level(BSP_TOUCH_INT) == active_level) {
        if ((esp_timer_get_time() / 1000ULL - start_ms) > timeout_ms) break;
        vTaskDelay(pdMS_TO_TICKS(10));
    }
    return bsp_sleep_enter_now();
}

esp_err_t bsp_sleep_quiesce(const bsp_sleep_prep_cfg_t *cfg)
{
    if (!cfg) return ESP_ERR_INVALID_ARG;

    if (cfg->turn_off_backlight) {
        (void)bsp_display_backlight_off();
    }
    if (cfg->clear_leds) {
        (void)bsp_led_stop_effect();
        (void)bsp_led_clear_all();
    }
    if (cfg->stop_audio) {
        (void)audio_player_stop();
        // keep deinit decision to app; deinit increases wake latency
    }
    if (cfg->deinit_buttons) {
        (void)bsp_button_deinit();
    }
    if (cfg->deinit_i2c) {
        (void)bsp_i2c_deinit();
    }
    if (cfg->power_off_before_sleep) {
        // Caution: do NOT cut power to touch IC or RTC domain if touch wake is required
        bsp_power_control_set_power(false);
    }
    return ESP_OK;
}

esp_err_t bsp_sleep_prepare_and_enter(const bsp_sleep_prep_cfg_t *cfg)
{
    if (!cfg) return ESP_ERR_INVALID_ARG;

    ESP_ERROR_CHECK(bsp_sleep_quiesce(cfg));
    ESP_ERROR_CHECK(bsp_sleep_enable_touch_wakeup(cfg->wake_level, cfg->use_internal_pullup));

    if (cfg->wait_touch_release) {
        return bsp_sleep_wait_touch_release_and_enter(cfg->wait_timeout_ms);
    }
    return bsp_sleep_enter_now();
}

esp_err_t bsp_touch_wakeup_clear_irq(void)
{
    // Ensure I2C bus exists
    if (bsp_i2c_get_bus_handle() == NULL) {
        bsp_i2c_config_t i2c_cfg = {
            .sda_io_num = BSP_I2C_SDA,
            .scl_io_num = BSP_I2C_SCL,
            .clk_speed  = BSP_I2C_CLK_SPEED,
            .enable_internal_pullup = true,
        };
        esp_err_t e = bsp_i2c_init(&i2c_cfg);
        if (e != ESP_OK) {
            ESP_LOGE(TAG, "I2C init failed in wake IRQ clear: %s", esp_err_to_name(e));
            return e;
        }
    }

    // Minimal touch IC init without ISR to just read status once
    if (!touch_ic_bs8112a3_is_initialized()) {
        touch_ic_bs8112a3_config_t touch_cfg = {
            .i2c_bus_handle = bsp_i2c_get_bus_handle(),
            .device_address = BS8112A3_I2C_ADDR,
            .scl_speed_hz   = BSP_I2C_CLK_SPEED,
            .interrupt_pin  = GPIO_NUM_NC, // no ISR for early clear
        };
        esp_err_t e = touch_ic_bs8112a3_init(&touch_cfg);
        if (e != ESP_OK) {
            ESP_LOGE(TAG, "Touch IC early init failed: %s", esp_err_to_name(e));
            return e;
        }
    }

    uint8_t status = touch_ic_bs8112a3_get_key_status();
    ESP_LOGI(TAG, "Touch status read after wake: 0x%02X (IRQ cleared)", status);

    // Deinit to avoid duplication with later full init path (optional)
    esp_err_t de = touch_ic_bs8112a3_deinit();
    if (de != ESP_OK) {
        ESP_LOGW(TAG, "Touch IC deinit after wake returned: %s", esp_err_to_name(de));
        // keep going
    }
    return ESP_OK;
}

